Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/emergency_health_services/emergency_health_services_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Emergency health services in Ireland provide medical attention for illnesses or injuries requiring immediate treatment
ga: Déanann seirbhísí éigeandála sláinte in Éirinn freastal míochaine ar thinnis nó ar ghortuithe a mbíonn cóireáil leighis de dhíth ina leith láithreach

source: Typical examples of injuries that may require emergency health services include those resulting from accidents, heart attacks or other sudden illnesses
ga: D’fhéadfadh seirbhísí éigeandála sláinte a bheith riachtanach le haghaidh gnáthshamplaí gortuithe lena n-áirítear gortuithe a tharla de bharr timpistí, taomanna croí nó galair thobanna eile

source: Emergency health services are usually delivered by a general practitioner (GP), ambulance personnel or by attendance at the Accident and Emergency Department of an acute hospital
ga: De ghnáth is dochtúir ginearálta (GP), pearsanra otharchairr nó foireann na roinne Timpistí agus Éigeandála in ospidéal géarmhíochaine a chuireann seirbhísí éigeandála sláinte ar fáil

source: The Department of Health has overall responsibility for policy on accident and emergency health services in Ireland
ga: Is ar an Roinn Sláinte atá an fhreagracht fhoriomlán maidir le beartas le haghaidh seirbhísí sláinte timpistí agus éigeandála in Éirinn

source: The Health Service Executive (HSE) has responsibility for the delivery of public health emergency health services
ga: Is í Feidhmeannacht na Seirbhíse Sláinte (FSS) atá freagrach as seirbhísí éigeandála sláinte poiblí a chur ar fáil

source: In the public health service, the National Ambulance Service provides ambulance services for transporting seriously ill people to hospitals or between hospitals
ga: Sa tseirbhís sláinte poiblí, cuireann an tSeirbhís Náisiúnta Otharcharranna seirbhísí otharcharranna ar fáil chun daoine atá go dona tinn a iompar chuig ospidéil phoiblí nó idir ospidéil phoiblí

source: The Dublin Fire Brigade provides an emergency ambulance service for the greater Dublin area
ga: Cuireann Briogáid Dóiteáin Bhaile Átha Cliath seirbhís otharcharranna ar fáil do mhórcheantar Bhaile Átha Cliath

source: Emergency ambulance services can be contacted by telephoning 999 or 112
ga: Is féidir leat teagmháil a dhéanamh leis na seirbhísí otharcharranna mar chuid de na seirbhísí éigeandála trí ghlao a chur ar 999 nó ar 112

source: (The 112 number applies throughout the EU)
ga: (Tá an uimhir 112 i bhfeidhm ar fud an AE)

source: All calls are free
ga: Bíonn gach glao saor in aisce

source: Where services are provided to bring patients to or from non-urgent healthcare, other vehicles may be used if appropriate (for example taxis or minibuses)
ga: Sa chás ina gcuirtear seirbhísí ar fáil d'othair chun iad a thabhairt chuig nó ó chúram sláinte neamh-phráinneach, is féidir feithiclí eile a úsáid más cuí (mar shampla tacsaithe nó mionbhusanna)

source: The Intermediate Care Service provides vehicles for transport of patients between hospitals and other medical facilities to ensure emergency ambulances are available to respond to emergencies
ga: Soláthraíonn an tSeirbhís Chúraim Idirmheánach feithiclí d'iompar na n-othar idir ospidéil agus saoráidí leighis eile chun a chinntiú go bhfuil otharcharranna éigeandála ar fáil chun freagra a thabhairt ar éigeandálaí

source: Unless you have a medical card, you may be charged for ambulance services
ga: Mura bhfuil cárta leighis agat, d'fhéadfaí costas na seirbhíse otharcharranna a ghearradh ort

source: However, the practice varies between different parts of the country and charges may be waived in certain cases, for example, in cases of hardship
ga: Mar sin féin ní hionann an cleachtas idir páirteanna éagsúla den tír agus d’fhéadfaí costais a tharscaoileadh i gcásanna áirithe, mar shampla, i gcásanna cruatain

source: There are a number of private ambulance services, including air ambulance services
ga: Tá roinnt seirbhísí otharcharranna príobháideacha, lena n-áirítear seirbhísí aerárthacha

source: You can call them and pay for their services in the normal commercial manner
ga: Ghlaonn tú orthu agus íocann tú as a gcuid seirbhísí sa ghnáthmhodh tráchtála

source: There are also a number of volunteer ambulance organisations
ga: Tá roinnt eagraíochtaí deonacha otharcharranna ann freisin

source: They are generally used to provide immediate assistance at public events
ga: Úsáidtear iad de ghnáth chun cúnamh láithreach a chur ar fáil ag imeachtaí poiblí

source: The Pre-Hospital Emergency Care Council is the national body with responsibility for the professional regulation of ambulance personnel and for education and training in the area of pre-hospital emergency care in Ireland
ga: Is í an Chomhairle um Chúram Práinne Réamh-Ospidéil an comhlacht náisiúnta atá freagrach as rialáil ghairmiúil pearsanra otharcharranna agus as oideachas agus oiliúint i réimse cúraim éigeandála réamh-ospidéal in Éirinn

source: Family doctor (GP) emergency care
ga: Cúram éigeandála ó dhochtúir teaghlaigh (GP)

source: If you wish to attend your family doctor (GP) as a result of an emergency you can:
ga: Má theastaíonn uait freastal ar do dhochtúir teaghlaigh (GP) de dheasca éigeandála, is iad seo a leanas na roghanna atá ann chun teagmháil a dhéanamh leo;

source: • Attend at a surgery operated by your GP during specific hours
ga: • Freastal ar lialann arna hoibriú ag do GP i rith uaireanta áirithe

source: You can find out what these hours are by contacting your GP
ga: Is féidir leat a fháil amach cad iad na huaireanta seo trí dhul i dteagmháil le do GP

source: • Phone your GP and ask for them to visit you during the time set aside for house calls
ga: • Glao teileafóin a chur ar do GP agus iarraidh air/uirthi cuairt a thabhairt ort i rith an ama atá curtha ar leataobh le haghaidh cuairteanna tí

source: • Phone your GP outside normal hours – the answering machine will usually indicate the number to ring in emergencies
ga: • Glaoch a chur ar do GP lasmuigh de ghnáthuaireanta – beidh an uimhir le haghaidh éigeandálaí le fáil i dteachtaireacht an ghléis de ghnáth

source: This number may be a locum service or out-of-hours service
ga: D’fhéadfadh an uimhir seo a bheith i gcomhair seirbhíse ionadaí nó seirbhíse lasmuigh d’uaireanta gnó

source: A locum service is one in which another doctor (not your GP) calls to the home of patients outside normal hours
ga: Is éard is seirbhís ionadaí ná go dtabharfaidh dochtúir eile (seachas do GP) cuairt ar theach othair lasmuigh de ghnáthuaireanta

source: • Visit a GP out-of-hours co-operative
ga: • Cuairt a thabhairt ar chomharchumann le haghaidh GP lasmuigh de ghnáthuaireanta

source: In parts of Ireland, GPs have come together to form co-operatives providing a medical service outside normal working hours
ga: I bpáirteanna d’Éirinn, tagann GPanna le chéile d’fhonn comharchumainn a chruthú le gur féidir seirbhís mhíochaine a chur ar fáil lasmuigh de ghnáthuaireanta oibre

source: These co-operatives receive financial assistance from the State
ga: Faigheann na comharchumainn seo cúnamh airgeadais ón stát

source: The co-operative may be based in a health centre, public hospital or in another location, often provided by the Health Service Executive
ga: D’fhéadfadh an comharchumann a bheith lonnaithe in ionad sláinte, in ospidéal poiblí nó i láthair eile, arna cur ar fáil go minic ag Feidhmeannacht na Seirbhíse Sláinte

source: Participating GPs provide this service on a rota basis in the evenings, at weekends and on bank and public holidays
ga: Cuireann GPanna an tseirbhís seo ar fáil ar bhonn uainchláir sna tráthnónta, ag an deireadh seachtaine agus ar laethanta saoire bainc agus poiblí

source: Generally the service is available to the patients of the GPs participating in the co-op
ga: Ní bhíonn an tseirbhís seo ar fáil de ghnáth ach amháin d’othair na GPanna atá rannpháirteach sa chomharchumann

source: It is necessary to telephone a contact number to access the service and the appropriate care may be telephone advice by a nurse or doctor
ga: Is gá glao teileafóin a chur chun rochtain a fháil ar an tseirbhís agus d’fhéadfadh gur ionann an cúram cuí is comhairle ó altra nó ó dhochtúir ar an teileafón

source: Care may also include attendance at a treatment centre or a visit to your home by the doctor on duty
ga: D’fhéadfadh freastal ar ionad cóireála leighis nó cuairt ar do theach ón dochtúir ar dualgas a bheith san áireamh le cúram chomh maith

source: Medical card and GP visit card holders don't have to pay for the services provided by the GP out-of-hours co-operatives
ga: Ní gá dóibh siúd a bhfuil cárta leighis nó cárta cuairt dochtúra acu íoc as na seirbhísí a chuireann comharchumainn GP lasmuigh de ghnáthuaireanta ar fáil

source: Other patients have to pay a fee
ga: Ní mór d’othair eile íoc as costas iomlán úsáid na seirbhíse seo

source: Find a list of GP out-of-hours services here
ga: Faigh liosta seirbhísí GPanna lasmuigh d’uaireanta gnó anseo

source: Accident and Emergency Departments of public hospitals
ga: Ranna Timpistí agus Éigeandála in ospidéil phoiblí

source: Most public hospitals provide accident and emergency services
ga: Cuireann formhór na n-ospidéal poiblí seirbhísí timpistí agus éigeandála ar fáil

source: Anybody in Ireland with a medical emergency is entitled to attend their Accident and Emergency Departments
ga: Tá duine ar bith in Éirinn atá faoi réir ag éigeandáil mhíochaine i dteideal freastal ar roinn Timpistí agus Éigeandála

source: You may have to pay charges for public hospital services
ga: D’fhéadfadh costais a bheith i gceist maidir le seirbhísí ospidéil phoiblí

source: People attending the Accident and Emergency Department of a public hospital are prioritised on the basis of medical need
ga: Tugtar tosaíocht dóibh siúd a dhéanann freastal ar Roinn Timpistí agus Éigeandála in ospidéil phoiblí de réir an ghátair mhíochaine

source: You may be required to wait for treatment if you have a non-urgent injury or illness
ga: D’fhéadfadh go mbeadh ar dhuine a bhfuil tinneas neamhphráinneach air/uirthi fanacht ar chóireáil leighis

source: Some private hospitals and clinics offer emergency services
ga: Cuireann roinnt ospidéal phríobháideacha seirbhísí éigeandála ar fáil

source: You will be charged the full cost of care in private facilities
ga: Gearrfar costas iomlán an chúraim i saoráidí príobháideacha ort

source: Entitlement of visitors to Ireland to emergency health services
ga: Teidlíocht cuairteoirí ar Éirinn i leith seirbhísí éigeandála sláinte

source: If you are a national of a member state of the European Union (EU), European Economic Area (EEA) or Switzerland and you are travelling or staying temporarily in Ireland, you are entitled to receive medical care if you become ill or have an accident
ga: Má tá tú i do náisiúnach ó bhallstáit den Aontas Eorpach (AE), den Limistéar Eorpach Eacnamaíoch (LEE) nó ón Eilvéis atá ag taisteal in Éirinn nó ag fanacht go sealadach in Éirinn, tá tú i dteideal seirbhísí sláinte má éiríonn tú tinn nó má tharlaíonn timpiste duit

source: These services are provided free of charge through the public health system on production of a valid European Health Insurance Card (EHIC)
ga: Cuirtear na seirbhísí seo ar fáil saor in aisce tríd an gcóras sláinte poiblí ach Cárta Eorpach um Árachas Sláinte (EHIC) bailí a thaispeáint

source: There is a reciprocal agreement on medical treatment for temporary visitors between Ireland and Australia
ga: Tá comhaontú cómhalartach ar chóir leighis do chuairteoirí sealadacha idir Éire agus an Astráil

source: Under the agreement, Australian visitors who access emergency public treatment pay the hospital charges that apply to people who are ordinarily resident in Ireland
ga: Faoin gcomhaontú, íocann cuairteoirí na hAstráile a fhaigheann cóireáil phoiblí éigeandála na táillí ospidéil a bhaineann le daoine a bhfuil gnáthchónaí orthu in Éirinn

source: If you are on a temporary visit to Ireland and are not covered under EU regulations, you will have to pay the cost of attendance at an Accident and Emergency Department
ga: Má tá tú ar cuairt shealadach ar Éirinn, beidh ort íoc as an gcostas a ghabhann le freastal ar Roinn Timpistí agus Éigeandála

source: If you are not a national of an EU/EEA member state, or from Switzerland or Australia, you may also be charged the full economic cost of any further treatment, including medical care in an acute hospital
ga: Mura bhfuil tú i do náisiúnach ó bhallstát AE/LEE, nó ón Eilvéis nó ón Astráil, beidh ort íoc as an gcostas eacnamaíoch iomlán a ghabhann le cóireáil leighis bhreise ar bith, lena n-áirítear cúram míochaine in ospidéal géarmhíochaine

source: Therefore taking out private medical travel insurance before travelling is recommended
ga: Moltar duit árachas míochaine príobháidí chun críocha taistil a cheannach sula rachfá ag taisteal
